status/2021/22jan21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>16 January 2021 - 22 January 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">16 January 2021 - 22 January 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc06640f">1. EPICS</a></li>
<li><a href="#org8cc1e0c">2. Brini Tracker II</a></li>
<li><a href="#org467c7ec">3. Dodecahedron</a></li>
<li><a href="#org4f81e07">4. ca-r</a></li>
<li><a href="#orgdc57e26">5. GEOS</a></li>
<li><a href="#org0b63a25">6. Books</a>
<ul>
<li><a href="#org7fad8e1">6.1. The Fabric of Civilization</a></li>
<li><a href="#org94cdff7">6.2. League of Regrettable Superheros</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
A Page is Turned
</p>

<div id="outline-container-orgc06640f" class="outline-2">
<h2 id="orgc06640f"><span class="section-number-2">1.</span> EPICS</h2>
<div class="outline-text-2" id="text-1">
<p>
u3hv-scpi guts torn out and started rebuild toward new SCPI command
structure. Added an API layer between SCPI command handling and U3A
library device interfaces. Debugging U3A read<sub>defaults</sub> command problem
where the "current" U3 state is not returned correctly. There was at
least a problem in the read<sub>default</sub> opcode construction, so this is
not a well-tested area. Fixed some U3A memory leaks. libusb seems to
be a bit leaky itself. Did I ever tell you I hate USB?
</p>
</div>
</div>

<div id="outline-container-org8cc1e0c" class="outline-2">
<h2 id="org8cc1e0c"><span class="section-number-2">2.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-2">
<p>
Buttons work after a week of runtime. GPS display update still stops
responding after a few minutes.
</p>
</div>
</div>

<div id="outline-container-org467c7ec" class="outline-2">
<h2 id="org467c7ec"><span class="section-number-2">3.</span> Dodecahedron</h2>
<div class="outline-text-2" id="text-3">
<p>
Generating a polyhedron net using plotrb. Fixed plotrb GCC warning
with ruby 2.7.2p137. Nice to see this library getting some use again.
</p>
</div>
</div>

<div id="outline-container-org4f81e07" class="outline-2">
<h2 id="org4f81e07"><span class="section-number-2">4.</span> ca-r</h2>
<div class="outline-text-2" id="text-4">
<p>
Added tier data. Have to scrape web page to get CSV data.
Disappointing that the distributed CSV file isn't directly parsable
because of the way the CSV header is constructed.
</p>
</div>
</div>

<div id="outline-container-orgdc57e26" class="outline-2">
<h2 id="orgdc57e26"><span class="section-number-2">5.</span> GEOS</h2>
<div class="outline-text-2" id="text-5">
<p>
No progress.
</p>
</div>
</div>

<div id="outline-container-org0b63a25" class="outline-2">
<h2 id="org0b63a25"><span class="section-number-2">6.</span> Books</h2>
<div class="outline-text-2" id="text-6">
<p>
A couple of books received at Christmas:
</p>
</div>
<div id="outline-container-org7fad8e1" class="outline-3">
<h3 id="org7fad8e1"><span class="section-number-3">6.1.</span> The Fabric of Civilization</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Excellent discussion of how fabric technology influences global civilization
from prehistory to now.
<a href="https://www.barnesandnoble.com/w/fabric-of-civilization-virginia-postrel/1136665703">https://www.barnesandnoble.com/w/fabric-of-civilization-virginia-postrel/1136665703</a>
</p>
</div>
</div>
<div id="outline-container-org94cdff7" class="outline-3">
<h3 id="org94cdff7"><span class="section-number-3">6.2.</span> League of Regrettable Superheros</h3>
<div class="outline-text-3" id="text-6-2">
<p>
What some people will do to get a kid's dime. Hilarious!
<a href="https://gone-and-forgotten.blogspot.com/2014/10/the-league-of-regrettable-superheroes.html">https://gone-and-forgotten.blogspot.com/2014/10/the-league-of-regrettable-superheroes.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
